/*
¬ main включить код дл€ проверки работы модул€ (добавить данные в стек, сн€ть со стека,
попытатьс€ записать в переполненный стек и прочитать из пустого). –екомендую делать массив
не слишком большим (не больше 10 элементов), чтобы его заполнение не требовало больших усилий.
*/


#include <stdio.h>
#include <stdlib.h>
#include "stack.h"

int main()
{
/*
    //ƒобавить данные в стек и сн€ть со стека
    show();
    push(1);
    push(2);
    printf("\n");
    show();
    pop();
    printf("\n");
    show();
    printf("\n");
    pop();
    show();
*/
/*
    //«апись в переполненный стек
    show();
    push(1);
    push(2);
    push(3);
    push(4);
    push(5);
    printf("\n");
    show();
    push(6);
    printf("\n");
    show();
*/
/*
    //„тение из пустого стека
    show();
    pop();
*/

    return 0;
}
